# Import des librairies

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# Etude du fichier customers

In [2]:
customers = pd.read_csv('data/raw/customers.csv')
customers.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

In [3]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

In [4]:
customers.client_id.nunique()

8623

In [5]:
customers.sex.unique()

array(['f', 'm'], dtype=object)

In [6]:
customers.birth.describe()

count    8623.000000
mean     1978.280877
std        16.919535
min      1929.000000
25%      1966.000000
50%      1979.000000
75%      1992.000000
max      2004.000000
Name: birth, dtype: float64

# Etude du fichier products

In [7]:
products = pd.read_csv('data/raw/products.csv')
products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

In [8]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3287 entries, 0 to 3286
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  3287 non-null   object
 1   price    3287 non-null   float64
 2   categ    3287 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 77.2+ KB

In [9]:
products.id_prod.nunique()

3287

In [10]:
products.price.describe()

count    3287.000000
mean       21.856641
std        29.847908
min        -1.000000
25%         6.990000
50%        13.060000
75%        22.990000
max       300.000000
Name: price, dtype: float64

In [11]:
products.loc[products['price'] <= 0].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 731 to 731
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  1 non-null      object
 1   price    1 non-null      float64
 2   categ    1 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 32.0+ bytes

In [12]:
products.loc[products['price'] <= 0].head()

    id_prod  price  categ
731     T_0   -1.0      0

In [13]:
products.categ.unique()

array([0, 1, 2], dtype=int64)

# Etude du fichier transactions

In [14]:
transactions = pd.read_csv('data/raw/transactions.csv')
transactions.head()

  id_prod                        date session_id client_id
0  0_1518  2022-05-20 13:21:29.043970   s_211425     c_103
1   1_251  2022-02-02 07:55:19.149409   s_158752    c_8534
2  0_1277  2022-06-18 15:44:33.155329   s_225667    c_6714
3   2_209  2021-06-24 04:19:29.835891    s_52962    c_6941
4  0_1509  2023-01-11 08:22:08.194479   s_325227    c_4232

In [15]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 679532 entries, 0 to 679531
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     679532 non-null  object
 1   date        679532 non-null  object
 2   session_id  679532 non-null  object
 3   client_id   679532 non-null  object
dtypes: object(4)
memory usage: 20.7+ MB

In [16]:
transactions.date.nunique()

679371

In [17]:
print((transactions['id_prod'].isin(products['id_prod'])).value_counts())

True     679311
False       221
Name: id_prod, dtype: int64

In [18]:
print((transactions['client_id'].isin(customers['client_id'])).value_counts())

True    679532
Name: client_id, dtype: int64

In [19]:
transactions[~transactions['id_prod'].isin(products['id_prod'])].id_prod.unique()

array(['0_2245'], dtype=object)

## Etude de la transaction T_0

In [20]:
transactions[transactions['id_prod']=="T_0"]

       id_prod                             date session_id client_id
3019       T_0  test_2021-03-01 02:30:02.237419        s_0      ct_0
5138       T_0  test_2021-03-01 02:30:02.237425        s_0      ct_0
9668       T_0  test_2021-03-01 02:30:02.237437        s_0      ct_1
10728      T_0  test_2021-03-01 02:30:02.237436        s_0      ct_0
15292      T_0  test_2021-03-01 02:30:02.237430        s_0      ct_0
...        ...                              ...        ...       ...
657830     T_0  test_2021-03-01 02:30:02.237417        s_0      ct_0
662081     T_0  test_2021-03-01 02:30:02.237427        s_0      ct_1
670680     T_0  test_2021-03-01 02:30:02.237449        s_0      ct_1
671647     T_0  test_2021-03-01 02:30:02.237424        s_0      ct_1
679180     T_0  test_2021-03-01 02:30:02.237425        s_0      ct_1

[200 rows x 4 columns]

In [21]:
transactions[transactions['id_prod']=="T_0"].session_id.unique()

array(['s_0'], dtype=object)

In [22]:
transactions[transactions['id_prod']=="T_0"].client_id.unique()

array(['ct_0', 'ct_1'], dtype=object)

## Suppression de la transaction test T_0

#### Dans le fichier transaction

In [23]:
transactions = transactions.drop(transactions[transactions.id_prod == "T_0"].index)
transactions[transactions['id_prod']=="T_0"]

Empty DataFrame
Columns: [id_prod, date, session_id, client_id]
Index: []

#### Dans le fichier customers

In [24]:
customers[(customers['client_id'] == "ct_1") | (customers['client_id'] == "ct_0")]

     client_id sex  birth
2735      ct_0   f   2001
8494      ct_1   m   2001

In [25]:
customers = customers.drop(customers[(customers.client_id == "ct_0") | (customers.client_id == "ct_1")].index)
customers[(customers['client_id'] == "ct_1") | (customers['client_id'] == "ct_0")]

Empty DataFrame
Columns: [client_id, sex, birth]
Index: []

In [26]:
customers['client_id'].filter(regex='^ct')

Series([], Name: client_id, dtype: object)

#### Dans le fichier products

In [27]:
products = products.drop(products[products.id_prod == "T_0"].index)
products[products['id_prod'] =="T_0"]

Empty DataFrame
Columns: [id_prod, price, categ]
Index: []

## Imputation du produit 0_2245

Calcul de la moyenne des prix des produits de la catégorie 0

In [28]:
products.groupby("categ")["price"].mean()

categ
0     11.732795
1     25.531421
2    108.354686
Name: price, dtype: float64

Calcul de la mediane des prix des produits de la catégorie 0

In [29]:
products.groupby("categ")["price"].median()

categ
0     10.32
1     22.99
2    101.99
Name: price, dtype: float64

In [30]:
new_row = {'id_prod':'0_2245', 'price':10.32, 'categ':0}
products = products.append(new_row, ignore_index=True)
products[products['id_prod'] == "0_2245"]

     id_prod  price  categ
3286  0_2245  10.32      0

In [31]:
transactions[~transactions['id_prod'].isin(products['id_prod'])].id_prod.unique()

array([], dtype=object)

# Combinaisons des fichiers

In [32]:
df = pd.merge(customers, transactions, on='client_id')
df.head()

  client_id sex  birth id_prod                        date session_id
0    c_4410   f   1967  0_1316  2021-12-29 09:11:18.860592   s_141762
1    c_4410   f   1967   1_385  2021-03-22 01:40:22.782925     s_9707
2    c_4410   f   1967   1_190  2021-11-12 18:11:43.280574   s_118628
3    c_4410   f   1967  0_1455  2021-03-22 14:29:25.189266     s_9942
4    c_4410   f   1967   1_483  2022-03-13 21:35:55.949042   s_178686

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 679332 entries, 0 to 679331
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   client_id   679332 non-null  object
 1   sex         679332 non-null  object
 2   birth       679332 non-null  int64
 3   id_prod     679332 non-null  object
 4   date        679332 non-null  object
 5   session_id  679332 non-null  object
dtypes: int64(1), object(5)
memory usage: 36.3+ MB

In [34]:
df = pd.merge(products, df, on='id_prod',how='inner')
df.head()

,id_prod,price,categ,client_id,sex,birth,date,session_id
0,0_1421,19.99,0,c_5152,f,1986,2021-04-17 06:09:37.424812,s_21727
1,0_1421,19.99,0,c_2167,f,1960,2021-11-24 00:28:06.088699,s_124134
2,0_1421,19.99,0,c_2167,f,1960,2022-08-24 00:28:06.088699,s_257560
3,0_1421,19.99,0,c_3060,m,1971,2021-04-06 09:35:05.954975,s_16742
4,0_1421,19.99,0,c_3060,m,1971,2022-03-06 09:35:05.954975,s_175117

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 679332 entries, 0 to 679331
Data columns (total 8 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     679332 non-null  object
 1   price       679332 non-null  float64
 2   categ       679332 non-null  int64
 3   client_id   679332 non-null  object
 4   sex         679332 non-null  object
 5   birth       679332 non-null  int64
 6   date        679332 non-null  object
 7   session_id  679332 non-null  object
dtypes: float64(1), int64(2), object(5)
memory usage: 46.6+ MB

# Création d'un fichier orders

Fichier contenant les différentes commandes effectuées par les clients avec le nombre d'articles, le prix total et la date de commande

In [36]:
orders = df.groupby(["session_id","client_id"], as_index=False).agg({'id_prod':'count', 'price':'sum','date':'first'})                       
orders.head()

  session_id client_id  id_prod  price                        date
0        s_1     c_329        1  11.99  2021-03-01 00:01:07.843138
1       s_10    c_2218        1  26.99  2021-03-01 00:10:33.163037
2      s_100    c_3854        2  33.72  2021-03-01 04:12:43.572994
3     s_1000    c_1014        4  39.22  2021-03-03 02:49:03.169115
4    s_10000     c_476        3  41.49  2021-03-22 17:46:05.819130

In [37]:
orders = orders.rename(columns = {'price':'total_price','id_prod':'nb_prod'})
orders.head()

  session_id client_id  nb_prod  total_price                        date
0        s_1     c_329        1        11.99  2021-03-01 00:01:07.843138
1       s_10    c_2218        1        26.99  2021-03-01 00:10:33.163037
2      s_100    c_3854        2        33.72  2021-03-01 04:12:43.572994
3     s_1000    c_1014        4        39.22  2021-03-03 02:49:03.169115
4    s_10000     c_476        3        41.49  2021-03-22 17:46:05.819130

In [38]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 342315 entries, 0 to 342314
Data columns (total 5 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   session_id   342315 non-null  object
 1   client_id    342315 non-null  object
 2   nb_prod      342315 non-null  int64
 3   total_price  342315 non-null  float64
 4   date         342315 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 15.7+ MB

In [39]:
orders[orders['session_id'] == "s_1"]

  session_id client_id  nb_prod  total_price                        date
0        s_1     c_329        1        11.99  2021-03-01 00:01:07.843138

In [40]:
orders.session_id.nunique()

342315

In [41]:
orders.client_id.nunique()

8600

# Export des fichiers nettoyés en fichier csv

In [42]:
df.to_csv('data/modified/transactions_final.csv', index=False)

In [43]:
orders.to_csv('data/modified/orders.csv', index=False)

In [44]:
products.to_csv('data/modified/products.csv', index=False)

In [45]:
customers.to_csv('data/modified/customers.csv', index=False)